Repository: Manish7093/IBus-Speech-To-Text
Catalog: po/*.po
Languages: fr

source: Executed by IBus
fr: Exécuté par IBus

source: Daemonize
fr: Exécuter en arrière plan

source: Debug
fr: Déboggage

source: Recognition off
fr: Reconnaissance inactive

source: Toggle speech recognition
fr: (Dés)activer la reconnaissance

source: Dictate
fr: Dicter

source: Toggle dictation mode
fr: (Dé)activer le mode dictée

source: Dictate (no formatting)
fr: Dicter (sans formatage)

source: Toggle dictation mode with no automatic formatting
fr: (Dés)activer la dictée sans mise en forme automatique du texte

source: Spell
fr: Épeler

source: Toggle spelling mode
fr: (Dés)activer le mode orthographe

source: Recognition mode
fr: Modes de reconnaissance

source: Use digits
fr: Ecrire en chiffres

source: Toggle the use of digits
fr: (Dés)activer l'utilisation des chiffres

source: Settings
fr: Paramètres

source: Configure IBus STT
fr: Configurer IBus STT

source: About IBus Speech To Text
fr: A propos de IBus Speech To Text

source: Learn more about IBus STT
fr: En savoir plus à propos de IBus STT

source: Recognition on
fr: Reconnaissance active

source: Recognition modes
fr: Modes de reconnaissance

source: What you say is always write.
fr: Ecrivez en dictant

source: translator-credits
fr: Philippe Rouquier

source: IBus STT Setup
fr: Configuration de IBus STT

source: General
fr: Général

source: Preload models
fr: Charger les modèles à l'avance

source: Starting voice recognition becomes faster but it requires more memory in between
fr: Démarrer la reconnaissance est plus rapide mais requiert plus de mémoire entre les périodes d'activité

source: Active on start
fr: Activer dès le lancement

source: Start voice recognition as soon as STT is activated
fr: Démarrer la reconnaissance dès que IBus STT est activé

source: System Locale
fr: Locale du système

source: Always use system locale.
fr: Toujours utiliser la locale du système

source: Text formatting
fr: Formatage du texte

source: Commands
fr: Commandes

source: Case
fr: Casse

source: Punctuation
fr: Ponctuation

source: Diacritics
fr: Signes diacritiques

source: Custom shortcuts
fr: Raccourcis personnalisés

source: Open Formatting File
fr: Ouvrir un fichier de formatage

source: Cancel
fr: Abandonner

source: Open
fr: Ouvrir

source: The file that defines automatic formatting for your locale does not have the proper format.
fr: Le fichier qui définit le formatage automatique du texte pour cette langue n'a pas le format requis.

source: A file that defines automatic formatting for your locale is missing. You can manually add one.
fr: Le fichier qui définit la locale n'a pu être trouvé. Vous pouvez en télécharger un manuellement.

source: There is no available model for the current locale
fr: Aucun modèle disponible pour la locale actuelle

source: Download Model
fr: Télécharger le modèle

source: %s : system locale
fr: %s : locale du système

source: No model downloaded yet
fr: Aucun modèle téléchargé

source: Custom model installed manually in a non-standard directory
fr: Modèle installé manuellement dans un dossier non standard

source: unknown size
fr: taille inconnue

source: This model is obsolete - %s
fr: Ce modèle est obsolète - %s

source: Large model that may be more accurate than smaller ones - %s
fr: Modèle de grande taille qui peut être plus précis que de plus petits - %s

source: Lightweight model for Android and RPi - %s
fr: Modèle de petite taille adapté pour Android et RPi - %s

source: No description available for the current model (name not found in online database)
fr: Aucune description disponible pour le modèle actuel (nom inconnu dans la base en ligne)

source: Manage Recognition Models
fr: Gérer les modèles de reconnaissance

source: Available models
fr: Modèles disponibles

source: A recognition model is required for recognition to proceed with the current locale. Larger models are usually more accurate but require more memory.
fr: Un modèle pour la locale sélectionnée est nécessaire que pour la reconnaissance vocale puisse fonctionner. Les modèles de grande taille permettent une reconnaissance plus précise mais requièrent plus de mémoire (jusqu'à 2 Gio parfois).

source: Show obsolete models
fr: Montrer les modèles obsolètes

source: Open Model
fr: Ouvrir un modèle

source: Shortcut Editing
fr: Editeur de raccourcis

source: Text
fr: Texte

source: Utterances
fr: Enoncés

source: Type a new utterance or correct the existing one
fr: Tapez un nouvel énoncé ou corrigez l'existant

source: Speak to add new utterances
fr: Parlez pour ajouter de nouveaux énoncés

source: Add Utterance
fr: Ajouter un énoncé

source: Apply Changes
fr: Appliquer les changements

source: Add Shortcurt
fr: Ajouter un raccourci

source: Character <span weight='heavy'>%s</span>
fr: Caractère <span weight='heavy'>%s</span>

source: Set IBus Speech to Text Preferences
fr: Configurer IBus Speech to Text

source: Speech To Text Component
fr: Composant de reconnaissance vocale

source: Start voice recognition as soon as the engine is enabled
fr: Démarre la reconnaissance dès que le moteur est activé

source: Start voice recognition as soon as the engine is enabled.
fr: Démarre la reconnaissance dès que le moteur est activé.

source: Preload the recognition engine's model to start more quickly when enabled
fr: Charge à l'avance le modèle pour le moteur de reconnaissance afin qu'il démarre plus rapidement dès qu'il est activé

source: Preload the recognition engine to start more quickly when enabled. There is a drawback though as most of the time engines' models require a lot of memory.
fr: Pré-charge le moteur de reconnaissance vocale pour que le démarrage soit plus rapide lorsqu'il est activé. Il y a un inconvénient cependant puisque la plupart des modèles requièrent beaucoup de mémoire.

source: Stop voice recognition if a key is pressed
fr: Arrête la reconnaissance vocale si une touche est pressée

source: Display partial results
fr: Montrer les résultats partiels

source: Use IBus preedit functionality to display partial results
fr: Utiliser la fonctionnalité de préédition d'IBus pour montrer les résultats partiels

source: Format partial results
fr: Formatter les résultats partiels

source: Format partial results as it is done for the final ones
fr: Formatter les résultats partiels comme cela est fait pour les finaux

source: Locale used
fr: Locale utilisée

source: Sets the currently used locale
fr: Fixe la locale en cours d'utilisation

source: Paths to VOSK models
fr: Chemins vers les modèles VOSK

source: A JSON formatted string that is used to associate locales with their models. It can be the name of a model if it is in default monitored paths or a custom path.
fr: Une chaîne de caractères au format JSON utilisée pour associer les locales avec leurs modèles. Cela peut être le nom du modèle si ce dernier se trouve dans un endroit standard monitoré ou un chemin personnalisé.

source: Paths to formatting files
fr: Chemins vers les fichiers de formatage

source: A JSON formatted string that is used to associate locales with a formatting file (used for automatic formatting of output). It is a custom path or nothing for defaut path.
fr: Une chaîne de caractères au format JSON utilisée pour associer les locales avec un fichier de formatage. Cela peut être un chemin personnalisé or rien pour le chemin par défaut.
